## Plan Result (sds_ptl - TerraformPlanApply)




<pre><code>Plan: 9 to add, 1 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_role_assignment.monitoring_reader[&#34;DTS-SHAREDSERVICES-DEMO&#34;]
  * azurerm_role_assignment.monitoring_reader[&#34;DTS-SHAREDSERVICES-DEV&#34;]
  * azurerm_role_assignment.monitoring_reader[&#34;DTS-SHAREDSERVICES-ITHC&#34;]
  * azurerm_role_assignment.monitoring_reader[&#34;DTS-SHAREDSERVICES-PROD&#34;]
  * azurerm_role_assignment.monitoring_reader[&#34;DTS-SHAREDSERVICES-SBOX&#34;]
  * azurerm_role_assignment.monitoring_reader[&#34;DTS-SHAREDSERVICES-STG&#34;]
  * azurerm_role_assignment.monitoring_reader[&#34;DTS-SHAREDSERVICES-TEST&#34;]
  * azurerm_role_assignment.monitoring_reader[&#34;DTS-SHAREDSERVICESPTL&#34;]
  * azurerm_role_assignment.monitoring_reader[&#34;DTS-SHAREDSERVICESPTL-SBOX&#34;]
* Update
  * azurerm_user_assigned_identity.this




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_role_assignment.monitoring_reader["DTS-SHAREDSERVICES-DEMO"] will be created
  + resource "azurerm_role_assignment" "monitoring_reader" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "ae3963c5-b695-42c9-aa24-1d32617f51d5"
      + principal_type                   = "ServicePrincipal"
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Monitoring Reader"
      + scope                            = "/subscriptions/6c4d2513-a873-41b4-afdd-b05a33206631/resourceGroups/sds-alerts-slack-ptl/providers/Microsoft.Insights/actionGroups/sds-alerts-slack-warning-alerts"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.monitoring_reader["DTS-SHAREDSERVICES-DEV"] will be created
  + resource "azurerm_role_assignment" "monitoring_reader" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "7e42722a-5c35-4b1b-9b86-1134470a245d"
      + principal_type                   = "ServicePrincipal"
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Monitoring Reader"
      + scope                            = "/subscriptions/6c4d2513-a873-41b4-afdd-b05a33206631/resourceGroups/sds-alerts-slack-ptl/providers/Microsoft.Insights/actionGroups/sds-alerts-slack-warning-alerts"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.monitoring_reader["DTS-SHAREDSERVICES-ITHC"] will be created
  + resource "azurerm_role_assignment" "monitoring_reader" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "75e3647a-cb2d-43ea-a3f0-6025d5e37711"
      + principal_type                   = "ServicePrincipal"
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Monitoring Reader"
      + scope                            = "/subscriptions/6c4d2513-a873-41b4-afdd-b05a33206631/resourceGroups/sds-alerts-slack-ptl/providers/Microsoft.Insights/actionGroups/sds-alerts-slack-warning-alerts"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.monitoring_reader["DTS-SHAREDSERVICES-PROD"] will be created
  + resource "azurerm_role_assignment" "monitoring_reader" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "ffc3a97e-f4fc-4866-a98a-8ba04923b0a8"
      + principal_type                   = "ServicePrincipal"
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Monitoring Reader"
      + scope                            = "/subscriptions/6c4d2513-a873-41b4-afdd-b05a33206631/resourceGroups/sds-alerts-slack-ptl/providers/Microsoft.Insights/actionGroups/sds-alerts-slack-warning-alerts"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.monitoring_reader["DTS-SHAREDSERVICES-SBOX"] will be created
  + resource "azurerm_role_assignment" "monitoring_reader" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "8e437d06-affa-4dca-a41a-1498238cb3b9"
      + principal_type                   = "ServicePrincipal"
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Monitoring Reader"
      + scope                            = "/subscriptions/6c4d2513-a873-41b4-afdd-b05a33206631/resourceGroups/sds-alerts-slack-ptl/providers/Microsoft.Insights/actionGroups/sds-alerts-slack-warning-alerts"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.monitoring_reader["DTS-SHAREDSERVICES-STG"] will be created
  + resource "azurerm_role_assignment" "monitoring_reader" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "881cece9-ee47-4c97-ab61-39bbe100893e"
      + principal_type                   = "ServicePrincipal"
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Monitoring Reader"
      + scope                            = "/subscriptions/6c4d2513-a873-41b4-afdd-b05a33206631/resourceGroups/sds-alerts-slack-ptl/providers/Microsoft.Insights/actionGroups/sds-alerts-slack-warning-alerts"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.monitoring_reader["DTS-SHAREDSERVICES-TEST"] will be created
  + resource "azurerm_role_assignment" "monitoring_reader" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "4f506f69-683c-450a-b3db-a1c571daf6df"
      + principal_type                   = "ServicePrincipal"
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Monitoring Reader"
      + scope                            = "/subscriptions/6c4d2513-a873-41b4-afdd-b05a33206631/resourceGroups/sds-alerts-slack-ptl/providers/Microsoft.Insights/actionGroups/sds-alerts-slack-warning-alerts"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.monitoring_reader["DTS-SHAREDSERVICESPTL"] will be created
  + resource "azurerm_role_assignment" "monitoring_reader" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "04939f22-03ce-4b89-9525-30d2757c6447"
      + principal_type                   = "ServicePrincipal"
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Monitoring Reader"
      + scope                            = "/subscriptions/6c4d2513-a873-41b4-afdd-b05a33206631/resourceGroups/sds-alerts-slack-ptl/providers/Microsoft.Insights/actionGroups/sds-alerts-slack-warning-alerts"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.monitoring_reader["DTS-SHAREDSERVICESPTL-SBOX"] will be created
  + resource "azurerm_role_assignment" "monitoring_reader" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "4200a3d0-f05d-4ca0-aaf7-e913c2d96e40"
      + principal_type                   = "ServicePrincipal"
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Monitoring Reader"
      + scope                            = "/subscriptions/6c4d2513-a873-41b4-afdd-b05a33206631/resourceGroups/sds-alerts-slack-ptl/providers/Microsoft.Insights/actionGroups/sds-alerts-slack-warning-alerts"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_user_assigned_identity.this will be updated in-place
  ~ resource "azurerm_user_assigned_identity" "this" {
        id                  = "/subscriptions/6c4d2513-a873-41b4-afdd-b05a33206631/resourceGroups/sds-alerts-slack-ptl/providers/Microsoft.ManagedIdentity/userAssignedIdentities/sds-alerts-slack-ptl"
        name                = "sds-alerts-slack-ptl"
      ~ tags                = {
          - "application"  = "core" -> null
          - "builtFrom"    = "hmcts/azure-alert-to-slack-function" -> null
          - "businessArea" = "Cross-Cutting" -> null
          - "environment"  = "production" -> null
        }
        # (5 unchanged attributes hidden)
    }

Plan: 9 to add, 1 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":34,"Program":"tfcmt","SHA1":"","Target":"sds_ptl - TerraformPlanApply","Vars":{}} -->